app/Http/Controllers/EmployeeController.php

select * from `departments`
select * from `departments` where `departments`.`id` in (1)
select * from `users` where `users`.`id` = '4' and `users`.`deleted_at` is null limit 1
---
    public function edit(string $id)
    {
        //
        $departments = Department::all();
        $employee = User::with('department')->find($id);

select * from `users` where `users`.`id` = '39' and `users`.`deleted_at` is null limit 1
update `users` set `name` = 'Lin Htut Kyaw', `phone` = '099312342233', `users`.`updated_at` = '2025-01-09 09:50:42' where `id` = 39
---
    public function update(EmployeeUpdateRequest $request, string $id)
    {
        $validator = $request->validated();
        // dd($validator);
        if ($validator) {
            $employee = User::findOrFail($id);
            $employee->update($validator);